imf-ontology-source.org
#+TITLE: IMF Ontology
#+DATE:
#+AUTHOR: Martin G. Skjæveland
#+EMAIL: martige@uio.no

#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

* TODOs                                                            :noexport:

 - separate into core, structure,  


 - [ ] Put the following somewhere

#+BEGIN_QUOTE
There are three primary aspects; they are function, location and
product. Other aspects are called secondary aspects. 

An integrated object is specified typically through multiple aspect
objects, but only one aspect object of each aspect is allowed. Every
aspect object is associated with only one integrated object.

An aspect object is also categorised according to how it may be
related to other aspect object.

@TODO: is it the case that an integrated object can only have one
aspect of the same aspect?

#+END_QUOTE

 - [ ] make examples using RDF and have them visualised.
 - [ ] what happens to comments on OTTR template instances?
 - [ ] make python script that makes nicely formatted text of the RDF?
   - remove extra space: " ".join(foo.split()) but keep double lineshifts
 - [ ] make shacl to check spelling of RDF, RDFS, OWL, and SKOS, SHACL vocabularies
 - [ ] replace Stream with Transport
 - [ ] Move in other todos
 - [ ] transport is subclass of fsb? A transport has exactly one in
   and one out. What is an interface? A transport where in=out?
 - [ ] Add versioning for each element; since version...


* Preliminaries
** Prefixes

#+NAME: prefixes-std
#+BEGIN_SRC ttl :tangle .prefixes.ttl :exports none
@prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
@prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
@prefix owl:    <http://www.w3.org/2002/07/owl#> .
@prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
@prefix imf:	<http://ns.imfid.org/imf#> .
@prefix sh: 	<http://www.w3.org/ns/shacl#> . 
@prefix shsh:   <http://www.w3.org/ns/shacl-shacl#> .
#+END_SRC

#+NAME: prefixes-ottr
#+BEGIN_SRC ttl :exports none
@prefix ottr:        <http://ns.ottr.xyz/0.4/> .
@prefix o-rdf:       <http://tpl.ottr.xyz/rdf/0.1/> .
@prefix o-owl-ax:    <http://tpl.ottr.xyz/owl/axiom/0.1/> .
@prefix o-owl-ma:    <http://tpl.ottr.xyz/owl/macro/0.1/> .
@prefix o-owl-rstr:  <http://tpl.ottr.xyz/owl/restriction/0.1/> .

@prefix o-imf:	     <http://ns.imfid.org/templates/> .
#+END_SRC

#+NAME: prefixes
#+BEGIN_SRC ttl :noweb yes
<<prefixes-std>>

<<prefixes-ottr>>
#+END_SRC

** SKOS

The ontology is defined using the SKOS vocabulary. For convenience,
the definition of the most used annotation properties are copied in
from https://www.w3.org/TR/skos-primer/#secdocumentation:

General documentation purposes:

 - skos:scopeNote :: supplies some, possibly partial, information
                     about the intended meaning of a concept,
                     especially as an indication of how the use of a
                     concept is limited in indexing practice.
 - skos:definition :: supplies a complete explanation of the intended
      meaning of a concept.
 - skos:example :: supplies an example of the use of a concept.
 - skos:historyNote :: describes significant changes to the meaning or
      the form of a concept.

Editorial purposes:

 - skos:editorialNote :: supplies information that is an aid to
      administrative housekeeping, such as reminders of editorial work
      still to be done, or warnings in the event that future editorial
      changes might be made.
 - skos:changeNote :: documents fine-grained changes to a concept, for
      the purposes of administration and maintenance.


** RDF templates of OWL constructs                                 :noexport:

#+BEGIN_SRC ttl

# a owl:Class ;

  ### annotations

  #skos:prefLabel "";
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  #skos:scopeNote """
  #""";

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  ### axioms

#+END_SRC

* Namespace and Identifiers

The namespace for resources used by the IMF ontology and other
publicly available online resources is:

 : http://ns.imfid.org/imf#

The identifier schema for IMF ontology versions are:

 : http://ns.imfid.org/ontology/[yyyy-mm-dd]/[ontology-name]

* IMF Ontology
** QA tests                                                              :QA:

#+CALL: sh_jena_validate_rdf(files="imf.owl.ttl")

#+RESULTS:
: imf.owl.ttl     : 0.20 sec : 8 Triples : 40.40 per second

#+CALL: sh_jena_shacl_validate_std-vocabulary(files="imf.owl.ttl")

#+RESULTS:
#+BEGIN_src ttl
@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sh:   <http://www.w3.org/ns/shacl#> .
@prefix xsd:  <http://www.w3.org/2001/XMLSchema#> .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .
#+END_src

