imf-ontology-source.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-02 Wed 12:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IMF Ontology</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Martin G. Skjæveland" />
</head>
<body>
<div id="content">
<h1 class="title">IMF Ontology</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org575addd">1. Preliminaries</a>
<ul>
<li><a href="#org0a55373">1.1. Prefixes</a></li>
<li><a href="#org8cd087a">1.2. SKOS</a></li>
</ul>
</li>
<li><a href="#orgd8a48ce">2. Namespace and Identifiers</a></li>
<li><a href="#org6216822">3. IMF Ontology</a>
<ul>
<li><a href="#orgb6542f1">3.1. QA tests&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QA">QA</span></span></a></li>
<li><a href="#org895f414">3.2. Ontology header</a></li>
</ul>
</li>
<li><a href="#org94f48b0">4. IMF Top Ontology</a>
<ul>
<li><a href="#orgcd73c85">4.1. Processing and QA&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QA">QA</span></span></a>
<ul>
<li><a href="#orgb98cdea">4.1.1. RDF validate tangled file</a></li>
<li><a href="#orgaaeb3e1">4.1.2. Expand OTTR instances</a></li>
<li><a href="#org5f4f50d">4.1.3. RDF validate final file</a></li>
</ul>
</li>
<li><a href="#org6e40f25">4.2. Ontology header</a></li>
<li><a href="#orgdb168da">4.3. Aspects, Aspect objects and Integrated objects</a>
<ul>
<li><a href="#org7a3b589">4.3.1. Aspect Object</a></li>
<li><a href="#org1d961cb">4.3.2. Aspect</a></li>
<li><a href="#orge7fc3b4">4.3.3. Integrated Object</a></li>
</ul>
</li>
<li><a href="#org2e05294">4.4. Relations between aspect objects</a>
<ul>
<li><a href="#org6d9d4dc">4.4.1. High-level structural relations</a></li>
<li><a href="#orgfdc00d9">4.4.2. Hierarchical relations</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge5ae2dd">5. <span class="todo TODO">TODO</span> IMF Metamodel Ontology</a>
<ul>
<li><a href="#orgec43f7a">5.1. <span class="todo TODO">TODO</span> Preliminary definitions</a>
<ul>
<li><a href="#org9c68336">5.1.1. System</a></li>
<li><a href="#org54b6a2a">5.1.2. Transport</a></li>
<li><a href="#orgcdc7ce0">5.1.3. Terminal/Port</a></li>
<li><a href="#org526503f">5.1.4. Connection</a></li>
<li><a href="#org2c9b540">5.1.5. Stream</a></li>
</ul>
</li>
<li><a href="#orgd7f6a54">5.2. <span class="todo TODO">TODO</span> Processing and QA&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QA">QA</span></span></a></li>
<li><a href="#org9a4b0f0">5.3. Ontology header</a></li>
<li><a href="#orgc4d18ec">5.4. Aspect object subtypes and their relations</a>
<ul>
<li><a href="#org38b3b72">5.4.1. Terminal</a></li>
<li><a href="#orgeb2aacd">5.4.2. System block</a></li>
<li><a href="#org2074f00">5.4.3. Transport</a></li>
<li><a href="#org9ad0889">5.4.4. <span class="todo TODO">TODO</span> left-overs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1bc86eb">6. IMF Aspects Ontology</a>
<ul>
<li><a href="#org9d4a86d">6.1. Processing and QA&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QA">QA</span></span></a>
<ul>
<li><a href="#org6893d2e">6.1.1. RDF validate tangled file</a></li>
<li><a href="#org1597980">6.1.2. Expand OTTR instances</a></li>
<li><a href="#org94f10b9">6.1.3. RDF validate final file</a></li>
</ul>
</li>
<li><a href="#orga50693b">6.2. Ontology header</a></li>
<li><a href="#orge1c73b7">6.3. Aspect classes</a>
<ul>
<li><a href="#org75aae70">6.3.1. Aspect</a></li>
<li><a href="#orgcff5c36">6.3.2. Primary Aspect</a></li>
<li><a href="#org1ca69c7">6.3.3. Secondary Aspect</a></li>
</ul>
</li>
<li><a href="#orgb4c05b8">6.4. Aspects</a></li>
<li><a href="#orge022002">6.5. Inter-aspect relationships</a></li>
</ul>
</li>
<li><a href="#org74e8161">7. Summary of IMF ontologies</a>
<ul>
<li><a href="#org2164168">7.1. Classes</a></li>
<li><a href="#org09aaf89">7.2. Properties</a></li>
<li><a href="#orga3dcc78">7.3. Ontologies combined to one file</a></li>
</ul>
</li>
<li><a href="#orge8b772c">8. Visualisation Ontology</a></li>
<li><a href="#org3a1b8c9">9. Jena calls</a>
<ul>
<li><a href="#org89b1f09">9.1. RIOT</a></li>
<li><a href="#org9a12d7f">9.2. shacl</a></li>
<li><a href="#org80f1c15">9.3. sparql</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org575addd" class="outline-2">
<h2 id="org575addd"><span class="section-number-2">1</span> Preliminaries</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0a55373" class="outline-3">
<h3 id="org0a55373"><span class="section-number-3">1.1</span> Prefixes</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-ttl" id="org9b6aa18">@prefix xsd:	&lt;http://www.w3.org/2001/XMLSchema#&gt; .
@prefix rdf:	&lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix rdfs:	&lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix owl:    &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix skos:	&lt;http://www.w3.org/2004/02/skos/core#&gt; .
@prefix imf:	&lt;http://ns.imfid.org/imf#&gt; .
@prefix sh: 	&lt;http://www.w3.org/ns/shacl#&gt; . 
@prefix shsh:   &lt;http://www.w3.org/ns/shacl-shacl#&gt; .

@prefix ottr:        &lt;http://ns.ottr.xyz/0.4/&gt; .
@prefix o-rdf:       &lt;http://tpl.ottr.xyz/rdf/0.1/&gt; .
@prefix o-owl-ax:    &lt;http://tpl.ottr.xyz/owl/axiom/0.1/&gt; .
@prefix o-owl-ma:    &lt;http://tpl.ottr.xyz/owl/macro/0.1/&gt; .
@prefix o-owl-rstr:  &lt;http://tpl.ottr.xyz/owl/restriction/0.1/&gt; .

@prefix o-imf:	     &lt;http://ns.imfid.org/templates/&gt; .
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cd087a" class="outline-3">
<h3 id="org8cd087a"><span class="section-number-3">1.2</span> SKOS</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The ontology is defined using the SKOS vocabulary. For convenience,
the definition of the most used annotation properties are copied in
from <a href="https://www.w3.org/TR/skos-primer/#secdocumentation">https://www.w3.org/TR/skos-primer/#secdocumentation</a>:
</p>

<p>
General documentation purposes:
</p>

<dl class="org-dl">
<dt>skos:scopeNote</dt><dd>supplies some, possibly partial, information
about the intended meaning of a concept,
especially as an indication of how the use of a
concept is limited in indexing practice.</dd>
<dt>skos:definition</dt><dd>supplies a complete explanation of the intended
meaning of a concept.</dd>
<dt>skos:example</dt><dd>supplies an example of the use of a concept.</dd>
<dt>skos:historyNote</dt><dd>describes significant changes to the meaning or
the form of a concept.</dd>
</dl>

<p>
Editorial purposes:
</p>

<dl class="org-dl">
<dt>skos:editorialNote</dt><dd>supplies information that is an aid to
administrative housekeeping, such as reminders of editorial work
still to be done, or warnings in the event that future editorial
changes might be made.</dd>
<dt>skos:changeNote</dt><dd>documents fine-grained changes to a concept, for
the purposes of administration and maintenance.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgd8a48ce" class="outline-2">
<h2 id="orgd8a48ce"><span class="section-number-2">2</span> Namespace and Identifiers</h2>
<div class="outline-text-2" id="text-2">
<p>
The namespace for resources used by the IMF ontology and other
publicly available online resources is:
</p>

<pre class="example">
http://ns.imfid.org/imf#

</pre>

<p>
The identifier schema for IMF ontology versions are:
</p>

<pre class="example">
http://ns.imfid.org/ontology/[yyyy-mm-dd]/[ontology-name]

</pre>
</div>
</div>

<div id="outline-container-org6216822" class="outline-2">
<h2 id="org6216822"><span class="section-number-2">3</span> IMF Ontology</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb6542f1" class="outline-3">
<h3 id="orgb6542f1"><span class="section-number-3">3.1</span> QA tests&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QA">QA</span></span></h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
imf.owl.ttl     : 0.20 sec : 8 Triples : 39.60 per second

</pre>

<div class="org-src-container">
<pre class="src src-ttl">@prefix rdf:  &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix sh:   &lt;http://www.w3.org/ns/shacl#&gt; .
@prefix xsd:  &lt;http://www.w3.org/2001/XMLSchema#&gt; .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .
</pre>
</div>
</div>
</div>
