imf-ontology-source.org
** Ontology header

#+NAME: owl-imf-ontology
#+BEGIN_SRC ttl :noweb strip-export :tangle imf.owl.ttl
<<prefixes>>

<http://ns.imfid.org/imf> a owl:Ontology ;
    owl:versionIRI <http://ns.imfid.org/ontology/2022-01-31/imf> ;
    owl:imports 
      <http://ns.imfid.org/ontology/2022-01-31/imf-top> ,
      <http://ns.imfid.org/ontology/2022-01-31/imf-metamodel> ,
      <http://ns.imfid.org/ontology/2022-01-31/imf-aspects> ;
    skos:prefLabel "Information Modelling Framework Ontology " ;
    skos:altLabel "IMF ontology" ;
    skos:scopeNote """

      The IMF ontology is in its current version defined over
      different ontology documents: 

      1. IMF Top defines the very high-level classes and properties of
      the IMF ontology, such as AspectObject.

      2. IMF Metamodel defines the metamodel for aspect objects and
      their permissible properties.

      3. IMG Aspects defines the aspects that are available to aspect
      objects.

    """;

    #skos:editorialNote """
    #""";

    .
#+END_SRC

* IMF Top Ontology
** Processing and QA                                                     :QA:

This is placed here so that it is easier to syncronise filenames with
org-mode tangled files.

*** RDF validate tangled file

#+CALL: sh_jena_validate_rdf(files=".imf-top.wottr")

#+RESULTS:
: 15:40:04 INFO  riot            :: File: .imf-top.wottr
: .imf-top.wottr  : 0.23 sec : 90 Triples : 384.62 per second
: 15:40:04 INFO  riot            :: File: imf-top.owl
: imf-top.owl     : 0.01 sec : 78 Triples : 5,571.43 per second
: Total           : 0.25 sec : 168 Triples : 677.42 per second

*** Expand OTTR instances
#+CALL: lutra-expand(in=".imf-top.wottr", out="imf-top.owl.ttl")

#+RESULTS:
#+begin_example
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/DomainRange

[INFO] Fetched template http://tpl.ottr.xyz/rdf/0.1/Type

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectUnionOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubClassOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/TypedListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivalentClass

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/AllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/HasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ValueRestriction

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectExactCardinality
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectExactCardinality
[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectExactCardinality
[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ObjectCardinality
[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/Cardinality

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank503 : LUB<rdfs:Resource>, owl:onClass : LUB ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank503 : LUB<rdfs:Resource>, owl:qualifiedCard ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank503 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank503 : LUB<rdfs:Resource>, owl:onProperty :  ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#isAspectOf : LUB<ottr:IR ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#IntegratedObject : LUB<o ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#AspectObject : LUB<ottr: ...

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/axiom/0.1/DisjointClasses
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/DisjointClasses

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank504 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank504 : LUB<rdfs:Resource>, owl:members : LUB ...

[WARNING] Fetch missing template: http://ns.ottr.xyz/0.4/NullableTriple
[WARNING] Failed fetch for template http://ns.ottr.xyz/0.4/NullableTriple

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:NullableTriple(http://ns.imfid.org/imf#AspectObject : L ...
rapper: Parsing URI file:///home/martige/repo/imf-lab/imf-ontology/.imf-top.wottr.temp with parser turtle
rapper: Serializing with serializer turtle
rapper: Parsing returned 82 triples
#+end_example

*** RDF validate final file

#+CALL: sh_jena_validate_rdf(files="imf-top.owl.ttl")

#+RESULTS:
: imf-top.owl.ttl : 0.21 sec : 78 Triples : 369.67 per second

#+CALL: sh_jena_shacl_validate_std-vocabulary(files="imf-top.owl.ttl")

#+RESULTS:
#+BEGIN_src ttl
@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sh:   <http://www.w3.org/ns/shacl#> .
@prefix xsd:  <http://www.w3.org/2001/XMLSchema#> .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .
#+END_src

** Ontology header

#+NAME: owl-top-ontology
#+BEGIN_SRC ttl :noweb strip-export :tangle .imf-top.wottr
<<prefixes>>

<http://ns.imfid.org/imf-top> a owl:Ontology ;
    owl:versionIRI <http://ns.imfid.org/ontology/2022-01-31/imf-top> ;
    owl:imports <http://www.w3.org/2004/02/skos/core> ;
    skos:prefLabel "Information Modelling Framework Ontology: Top Ontology " ;
    skos:altLabel "IMF top ontology" ;
    skos:scopeNote """

      This ontology defines the very core classes and relations of the
      Information Modelling Framework (IMF) that provide a structure
      for ontologies that extend this ontology.

    """;
    #skos:editorialNote """
    #""";
    .

<<owl-top-aspectobject>>
<<owl-top-aspect>>
<<owl-top-integratedobject>>
<<owl-top-genericrelations>>
<<owl-top-hierarchicalrelations>>
#+END_SRC

*** QA                                                             :noexport:

#+CALL: py_parse-ttl-block[:wrap "SRC ttl :tangle .owl-top-ontology.wottr"](block=owl-top-ontology)

#+CALL: py_parse-ttl-file[:wrap SRC ttl](file="imf-top.owl.ttl")

** Aspects, Aspect objects and Integrated objects
