imf-ontology-source.html

<div id="outline-container-org895f414" class="outline-3">
<h3 id="org895f414"><span class="section-number-3">3.2</span> Ontology header</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-ttl" id="orgb811b90">

&lt;http://ns.imfid.org/imf&gt; a owl:Ontology ;
    owl:versionIRI &lt;http://ns.imfid.org/ontology/2022-01-31/imf&gt; ;
    owl:imports 
      &lt;http://ns.imfid.org/ontology/2022-01-31/imf-top&gt; ,
      &lt;http://ns.imfid.org/ontology/2022-01-31/imf-metamodel&gt; ,
      &lt;http://ns.imfid.org/ontology/2022-01-31/imf-aspects&gt; ;
    skos:prefLabel "Information Modelling Framework Ontology " ;
    skos:altLabel "IMF ontology" ;
    skos:scopeNote """

      The IMF ontology is in its current version defined over
      different ontology documents: 

      1. IMF Top defines the very high-level classes and properties of
      the IMF ontology, such as AspectObject.

      2. IMF Metamodel defines the metamodel for aspect objects and
      their permissible properties.

      3. IMG Aspects defines the aspects that are available to aspect
      objects.

    """;

    #skos:editorialNote """
    #""";

    .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org94f48b0" class="outline-2">
<h2 id="org94f48b0"><span class="section-number-2">4</span> IMF Top Ontology</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgcd73c85" class="outline-3">
<h3 id="orgcd73c85"><span class="section-number-3">4.1</span> Processing and QA&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QA">QA</span></span></h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is placed here so that it is easier to syncronise filenames with
org-mode tangled files.
</p>
</div>

<div id="outline-container-orgb98cdea" class="outline-4">
<h4 id="orgb98cdea"><span class="section-number-4">4.1.1</span> RDF validate tangled file</h4>
<div class="outline-text-4" id="text-4-1-1">
<pre class="example">
.imf-top.wottr  : 0.22 sec : 90 Triples : 401.79 per second

</pre>
</div>
</div>

<div id="outline-container-orgaaeb3e1" class="outline-4">
<h4 id="orgaaeb3e1"><span class="section-number-4">4.1.2</span> Expand OTTR instances</h4>
<div class="outline-text-4" id="text-4-1-2">
<pre class="example">
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/DomainRange

[INFO] Fetched template http://tpl.ottr.xyz/rdf/0.1/Type

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectUnionOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubClassOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/TypedListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivalentClass

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/AllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/HasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ValueRestriction

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectExactCardinality
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectExactCardinality
[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectExactCardinality
[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ObjectCardinality
[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/Cardinality

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank503 : LUB&lt;rdfs:Resource&gt;, owl:onClass : LUB ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank503 : LUB&lt;rdfs:Resource&gt;, owl:qualifiedCard ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank503 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank503 : LUB&lt;rdfs:Resource&gt;, owl:onProperty :  ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#isAspectOf : LUB&lt;ottr:IR ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#IntegratedObject : LUB&lt;o ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#AspectObject : LUB&lt;ottr: ...

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/axiom/0.1/DisjointClasses
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/DisjointClasses

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank504 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank504 : LUB&lt;rdfs:Resource&gt;, owl:members : LUB ...

[WARNING] Fetch missing template: http://ns.ottr.xyz/0.4/NullableTriple
[WARNING] Failed fetch for template http://ns.ottr.xyz/0.4/NullableTriple

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:NullableTriple(http://ns.imfid.org/imf#AspectObject : L ...
rapper: Parsing URI file:///home/martige/repo/imf-lab/imf-ontology/.imf-top.wottr.temp with parser turtle
rapper: Serializing with serializer turtle
rapper: Parsing returned 82 triples
</pre>
</div>
</div>

<div id="outline-container-org5f4f50d" class="outline-4">
<h4 id="org5f4f50d"><span class="section-number-4">4.1.3</span> RDF validate final file</h4>
<div class="outline-text-4" id="text-4-1-3">
<pre class="example">
imf-top.owl.ttl : 0.22 sec : 78 Triples : 351.35 per second

</pre>

<div class="org-src-container">
<pre class="src src-ttl">@prefix rdf:  &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix sh:   &lt;http://www.w3.org/ns/shacl#&gt; .
@prefix xsd:  &lt;http://www.w3.org/2001/XMLSchema#&gt; .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6e40f25" class="outline-3">
<h3 id="org6e40f25"><span class="section-number-3">4.2</span> Ontology header</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-ttl" id="org71c98cd">

&lt;http://ns.imfid.org/imf-top&gt; a owl:Ontology ;
    owl:versionIRI &lt;http://ns.imfid.org/ontology/2022-01-31/imf-top&gt; ;
    owl:imports &lt;http://www.w3.org/2004/02/skos/core&gt; ;
    skos:prefLabel "Information Modelling Framework Ontology: Top Ontology " ;
    skos:altLabel "IMF top ontology" ;
    skos:scopeNote """

      This ontology defines the very core classes and relations of the
      Information Modelling Framework (IMF) that provide a structure
      for ontologies that extend this ontology.

    """;
    #skos:editorialNote """
    #""";
    .






</pre>
</div>
</div>
</div>
