imf-ontology-source.org
*** Aspect Object

#+NAME: owl-top-aspectobject
#+BEGIN_SRC ttl
imf:AspectObject a owl:Class ;

  ### annotations

  skos:prefLabel "Aspect Object";
  
  #skos:altLabel "";

  skos:definition """

    An aspect object describes a specific type of feature (or aspect)
    of one (and exactly one) integrated object.""";

  skos:scopeNote """

    Overview:

    Aspect object is the most central concept of the IMF ontology.

    The following is used to define an aspect object:
   
    1. an aspect object must have a single aspect, we say that the
    aspect object "is of" this aspect.  

    2. an aspect object has a more specific subtype, being either a
    system block, a stream or a terminal. These types determine how
    the aspect object can be connected to other aspect objects.

    3. an aspect object can be further described by breaking it down
    into its parts or children. An aspect object is placed in a
    tree-shaped breakdown structure where the aspect object may have a
    single parent (the root object has no parent) and possibly
    multiple children.

  """;

  #skos:example """
  #""";

  skos:editorialNote """

  [2022-01-19 Wed] Is 'aspect object subtype' ok?

  [2022-01-20 Thu]: Add (RDL) types/attributes to the overview scopeNote?
  """;

  .


### properties

imf:isAspectOf a owl:ObjectProperty ;
  skos:prefLabel "is aspect of" ;
  skos:definition """

    Relates an aspect object with the integrated object the aspect
    object provides a specification for/description of.""";

  rdfs:domain imf:AspectObject ;
  rdfs:range imf:IntegratedObject .

imf:hasAspect a owl:ObjectProperty ;
  skos:prefLabel "has aspect" ;
  skos:definition "Relates an aspect object with its aspect.";
  rdfs:domain imf:AspectObject ;
  rdfs:range imf:Aspect .


### logical axioms

# An aspect object has/is of exactly one aspect:
[] ottr:of o-owl-ax:SubObjectExactCardinality ;
   ottr:values ( imf:AspectObject "1"^^xsd:nonNegativeInteger imf:hasAspect imf:Aspect ) .

# An aspect object is related to exactly one integrated object, i.e.,
# one aspect object cannot be used for multiple integrated objects
[] ottr:of o-owl-ax:SubObjectExactCardinality ; 
   ottr:values ( imf:AspectObject "1"^^xsd:nonNegativeInteger imf:isAspectOf imf:IntegratedObject ) .
#+END_SRC

*** Aspect

#+NAME: owl-top-aspect
#+BEGIN_SRC ttl
imf:Aspect a owl:Class ;

  ### annotations

  skos:prefLabel "Aspect";
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  #skos:scopeNote """
  #""";

  skos:example """Function, Location, Product are examples of aspects.""";

  #skos:editorialNote """
  #""";

  ### axioms

  .
#+END_SRC

*** Integrated Object

#+NAME: owl-top-integratedobject
#+BEGIN_SRC ttl
imf:IntegratedObject a owl:Class ;

  ### annotations

  skos:prefLabel "Integrated Object" ;
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  skos:scopeNote """

    The primary use of the IMF ontology is to specify requirements for
    entities, where 'entity' is ment in a very generic sense; an
    entity may be abstract or concrete, a high-level system, a product
    class or an installed product. In the ontology these entities are
    called integrated objects.

    Following the IMF methodology, an intergrated object is not
    described directly, but through typically multiple aspects
    objects. see also [imf:AspectObject].""" ;

  #skos:example """
  #""" ;

  skos:editorialNote """

    [2022-01-24 Mon] TODO: Verify the description in the scopeNote.

    [2022-01-19 Wed] Is it the case that an integrated object can only
    have one aspect of the same aspect? """ .

# class level axioms
[] ottr:of o-owl-ax:DisjointClasses ;
   ottr:values( ( imf:Aspect imf:AspectObject imf:IntegratedObject ) ) .
#+END_SRC

** Relations between aspect objects
*** High-level structural relations

The following scope note is put on all following top-level relations:
#+NAME: owl-top-toprelation-scope-note
#+BEGIN_SRC ttl
skos:scopeNote """

  This relation is used to enforce that subproperties respect this
  relation's definition. This must be enforced by introducing
  class axioms that locally further restrict the domain and range
  of the relation.
  
"""
#+END_SRC

#+NAME: owl-top-genericrelations
#+BEGIN_SRC ttl :noweb strip-export
imf:intraAspectRelation a owl:ObjectProperty ;
    rdfs:subPropertyOf skos:semanticRelation ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject ;
    skos:definition "A generic relation between aspect objects of the same aspect" ;
    <<owl-top-toprelation-scope-note>>
    .

imf:hierarchicalRelation a owl:ObjectProperty ;
    a owl:IrreflexiveProperty ;
    rdfs:subPropertyOf skos:semanticRelation ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject ;
    skos:definition "A generic hierachical relation that may be used to represent a breakdown structure." ;
    <<owl-top-toprelation-scope-note>>
    .

imf:associativeRelation a owl:ObjectProperty ;
    rdfs:subPropertyOf skos:related ;
    owl:propertyDisjointWith imf:hierachicalRelation ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject ;
    skos:definition "A generic associative relation." ;
    <<owl-top-toprelation-scope-note>>
    .
#+END_SRC

*** Hierarchical relations

#+NAME: owl-top-hierarchicalrelations
#+BEGIN_SRC ttl
imf:hasChild a owl:ObjectProperty ;
    rdfs:subPropertyOf imf:intraAspectRelation, imf:hierarchicalRelation, skos:narrower ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject .

imf:hasParent a owl:ObjectProperty;
    a owl:FunctionalProperty ;
    rdfs:subPropertyOf imf:intraAspectRelation, imf:hierarchicalRelation, skos:broader ;
    owl:inverseOf imf:hasChild .
#+END_SRC

* TODO IMF Metamodel Ontology
** TODO Preliminary definitions
*** System

A system is a processing (black) box. It processes streams by
performing some operation(s) on the input streams to produce the
output streams.

A system is the only thing that can change state of streams.

A system may have zero--many terminals. 

A system can be broken into sub/part/child systems. 

Questions:
 - Can a system have 0 terminals? Yes, but not useful.

*** Transport

A transport is a system with exactly two terminals which are of the
same "type", meaning that the processing a transport does is to
transport a stream.

David: A transport is a connection between systems. er samme som
connectedTo mellom terminaler?

? Why do we need Transports? Perhaps Stream replaces the need for
Transports?

