imf-ontology-source.html

<div id="outline-container-orgdb168da" class="outline-3">
<h3 id="orgdb168da"><span class="section-number-3">4.3</span> Aspects, Aspect objects and Integrated objects</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org7a3b589" class="outline-4">
<h4 id="org7a3b589"><span class="section-number-4">4.3.1</span> Aspect Object</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">
<pre class="src src-ttl" id="orge8e113d">imf:AspectObject a owl:Class ;

  ### annotations

  skos:prefLabel "Aspect Object";
  
  #skos:altLabel "";

  skos:definition """

    An aspect object describes a specific type of feature (or aspect)
    of one (and exactly one) integrated object.""";

  skos:scopeNote """

    Overview:

    Aspect object is the most central concept of the IMF ontology.

    The following is used to define an aspect object:
   
    1. an aspect object must have a single aspect, we say that the
    aspect object "is of" this aspect.  

    2. an aspect object has a more specific subtype, being either a
    system block, a stream or a terminal. These types determine how
    the aspect object can be connected to other aspect objects.

    3. an aspect object can be further described by breaking it down
    into its parts or children. An aspect object is placed in a
    tree-shaped breakdown structure where the aspect object may have a
    single parent (the root object has no parent) and possibly
    multiple children.

  """;

  #skos:example """
  #""";

  skos:editorialNote """

  [2022-01-19 Wed] Is 'aspect object subtype' ok?

  [2022-01-20 Thu]: Add (RDL) types/attributes to the overview scopeNote?
  """;

  .


### properties

imf:isAspectOf a owl:ObjectProperty ;
  skos:prefLabel "is aspect of" ;
  skos:definition """

    Relates an aspect object with the integrated object the aspect
    object provides a specification for/description of.""";

  rdfs:domain imf:AspectObject ;
  rdfs:range imf:IntegratedObject .

imf:hasAspect a owl:ObjectProperty ;
  skos:prefLabel "has aspect" ;
  skos:definition "Relates an aspect object with its aspect.";
  rdfs:domain imf:AspectObject ;
  rdfs:range imf:Aspect .


### logical axioms

# An aspect object has/is of exactly one aspect:
[] ottr:of o-owl-ax:SubObjectExactCardinality ;
   ottr:values ( imf:AspectObject "1"^^xsd:nonNegativeInteger imf:hasAspect imf:Aspect ) .

# An aspect object is related to exactly one integrated object, i.e.,
# one aspect object cannot be used for multiple integrated objects
[] ottr:of o-owl-ax:SubObjectExactCardinality ; 
   ottr:values ( imf:AspectObject "1"^^xsd:nonNegativeInteger imf:isAspectOf imf:IntegratedObject ) .
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d961cb" class="outline-4">
<h4 id="org1d961cb"><span class="section-number-4">4.3.2</span> Aspect</h4>
<div class="outline-text-4" id="text-4-3-2">
<div class="org-src-container">
<pre class="src src-ttl" id="org2a747e0">imf:Aspect a owl:Class ;

  ### annotations

  skos:prefLabel "Aspect";
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  #skos:scopeNote """
  #""";

  skos:example """Function, Location, Product are examples of aspects.""";

  #skos:editorialNote """
  #""";

  ### axioms

  .
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7fc3b4" class="outline-4">
<h4 id="orge7fc3b4"><span class="section-number-4">4.3.3</span> Integrated Object</h4>
<div class="outline-text-4" id="text-4-3-3">
<div class="org-src-container">
<pre class="src src-ttl" id="org394d972">imf:IntegratedObject a owl:Class ;

  ### annotations

  skos:prefLabel "Integrated Object" ;
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  skos:scopeNote """

    The primary use of the IMF ontology is to specify requirements for
    entities, where 'entity' is ment in a very generic sense; an
    entity may be abstract or concrete, a high-level system, a product
    class or an installed product. In the ontology these entities are
    called integrated objects.

    Following the IMF methodology, an intergrated object is not
    described directly, but through typically multiple aspects
    objects. see also [imf:AspectObject].""" ;

  #skos:example """
  #""" ;

  skos:editorialNote """

    [2022-01-24 Mon] TODO: Verify the description in the scopeNote.

    [2022-01-19 Wed] Is it the case that an integrated object can only
    have one aspect of the same aspect? """ .

# class level axioms
[] ottr:of o-owl-ax:DisjointClasses ;
   ottr:values( ( imf:Aspect imf:AspectObject imf:IntegratedObject ) ) .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2e05294" class="outline-3">
<h3 id="org2e05294"><span class="section-number-3">4.4</span> Relations between aspect objects</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org6d9d4dc" class="outline-4">
<h4 id="org6d9d4dc"><span class="section-number-4">4.4.1</span> High-level structural relations</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
The following scope note is put on all following top-level relations:
</p>
<div class="org-src-container">
<pre class="src src-ttl" id="orgb98b348">skos:scopeNote """

  This relation is used to enforce that subproperties respect this
  relation's definition. This must be enforced by introducing
  class axioms that locally further restrict the domain and range
  of the relation.
  
"""
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ttl" id="org8cd76bc">imf:intraAspectRelation a owl:ObjectProperty ;
    rdfs:subPropertyOf skos:semanticRelation ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject ;
    skos:definition "A generic relation between aspect objects of the same aspect" ;
    
    .

imf:hierarchicalRelation a owl:ObjectProperty ;
    a owl:IrreflexiveProperty ;
    rdfs:subPropertyOf skos:semanticRelation ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject ;
    skos:definition "A generic hierachical relation that may be used to represent a breakdown structure." ;
    
    .

imf:associativeRelation a owl:ObjectProperty ;
    rdfs:subPropertyOf skos:related ;
    owl:propertyDisjointWith imf:hierachicalRelation ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject ;
    skos:definition "A generic associative relation." ;
    
    .
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfdc00d9" class="outline-4">
<h4 id="orgfdc00d9"><span class="section-number-4">4.4.2</span> Hierarchical relations</h4>
<div class="outline-text-4" id="text-4-4-2">
<div class="org-src-container">
<pre class="src src-ttl" id="orgd2abf34">imf:hasChild a owl:ObjectProperty ;
    rdfs:subPropertyOf imf:intraAspectRelation, imf:hierarchicalRelation, skos:narrower ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject .

imf:hasParent a owl:ObjectProperty;
    a owl:FunctionalProperty ;
    rdfs:subPropertyOf imf:intraAspectRelation, imf:hierarchicalRelation, skos:broader ;
    owl:inverseOf imf:hasChild .
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orge5ae2dd" class="outline-2">
<h2 id="orge5ae2dd"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> IMF Metamodel Ontology</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgec43f7a" class="outline-3">
<h3 id="orgec43f7a"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> Preliminary definitions</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org9c68336" class="outline-4">
<h4 id="org9c68336"><span class="section-number-4">5.1.1</span> System</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
A system is a processing (black) box. It processes streams by
performing some operation(s) on the input streams to produce the
output streams.
</p>

<p>
A system is the only thing that can change state of streams.
</p>

<p>
A system may have zero&#x2013;many terminals. 
</p>

<p>
A system can be broken into sub/part/child systems. 
</p>

<p>
Questions:
</p>
<ul class="org-ul">
<li>Can a system have 0 terminals? Yes, but not useful.</li>
</ul>
</div>
</div>

<div id="outline-container-org54b6a2a" class="outline-4">
<h4 id="org54b6a2a"><span class="section-number-4">5.1.2</span> Transport</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
A transport is a system with exactly two terminals which are of the
same "type", meaning that the processing a transport does is to
transport a stream.
</p>

<p>
David: A transport is a connection between systems. er samme som
connectedTo mellom terminaler?
</p>

<p>
? Why do we need Transports? Perhaps Stream replaces the need for
Transports?
</p>
</div>
</div>
