imf-ontology-source.org
*** Terminal/Port

A terminal is a port/boundary point with which a system or a transport
is connected to other systems or transports.

Like systems, a terminal can be further specified through
sub/part/child terminals.

Question: 
 - Can a terminal be shared between a parent and a child system? I
   imagine that a system can be broken down, but that the terminal
   does not need to be.

*** Connection

A connection connects two terminals. A connection is used for
representing data about the connection, e.g., the force with which the
terminals can be disconnected.

? A connection can have system as children?

Questions:
  - Can a connection have a parent? Maybe not? It is necessary to
    have a parent?

*** Stream

Continuous

A stream represents a medium, a matter, abstact or concrete, which is
processed by a system. A stream "flows" between systems.

For streams, systems represent points where the number of terminals of
the system determines if and how the stream may be rearranged, i.e.,
split or joined or a combination. Since transports have exactly two
terminals, a transport does not need to be considered

A stream may be split up into connected sections/segments. ?-> Are not
these also just streams?

The relation between a stream and the system it is processed by or
flows though, is "contained by" -- or a different word? 
 - "eier" eller "har ansvar for"

Questions:
 - It is useful to identify points in the stream, e.g., the start and
   end of a stream. Should we call this a cross section, or is it just
   a stream -- or perhaps a stream boundary?
 - Can a stream be contained by a system, a transport, a terminal
   and/or a connection?
 - Can a stram be contained by multiple transports, e.g., some water
   may flow in multiple paralell pipes, or must the stream then be
   split into multiple streams to represent this?

** TODO Processing and QA                                                :QA:

TODO: copy from other ontologies once this ontology has settled.

This is placed here so that it is easier to syncronise filenames with
org-mode tangled files.

#+CALL: sh_jena_validate_rdf(files=".imf-metamodel.wottr imf-metamodel.owl.ttl")

#+RESULTS:
: 15:37:20 INFO  riot            :: File: .imf-metamodel.wottr
: .imf-metamodel.wottr : 0.24 sec : 60 Triples : 247.93 per second
: 15:37:20 INFO  riot            :: File: imf-metamodel.owl
: imf-metamodel.owl : 0.01 sec : 55 Triples : 5,500.00 per second
: Total           : 0.25 sec : 115 Triples : 456.35 per second

#+CALL: lutra-expand(in=".imf-metamodel.wottr", out="imf-metamodel.owl.ttl")

#+RESULTS:
#+begin_example
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/DomainRange

[INFO] Fetched template http://tpl.ottr.xyz/rdf/0.1/Type

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectUnionOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubClassOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/TypedListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivalentClass

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/AllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/HasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ValueRestriction

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/macro/0.1/ClassPartition
[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/ClassPartition
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectUnionOf
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/DisjointClasses

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank505 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank505 : LUB<rdfs:Resource>, owl:members : LUB ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank506 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank506 : LUB<rdfs:Resource>, owl:unionOf : LUB ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank506 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#AspectObject : LUB<ottr: ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#AspectObject : LUB<ottr: ...

[WARNING] Fetch missing template: http://ns.ottr.xyz/0.4/NullableTriple
[WARNING] Failed fetch for template http://ns.ottr.xyz/0.4/NullableTriple

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:NullableTriple(http://ns.imfid.org/imf#SystemBlock : LU ...
rapper: Parsing URI file:///home/martige/repo/imf-lab/imf-ontology/.imf-metamodel.wottr.temp with parser turtle
rapper: Serializing with serializer turtle
rapper: Parsing returned 59 triples
#+end_example


** Ontology header
#+NAME: owl-top-ontology
#+BEGIN_SRC ttl :noweb strip-export :tangle .imf-metamodel.wottr
<<prefixes>>

<http://ns.imfid.org/imf-metamodel> a owl:Ontology ;
    owl:versionIRI <http://ns.imfid.org/ontology/2022-01-31/imf-metamodel> ;
    owl:imports <http://ns.imfid.org/ontology/2022-01-31/imf-top> ;
    skos:prefLabel "Information Modelling Framework Ontology: Metamodel Ontology " ;
    skos:altLabel "IMF metamodel ontology" ;
    skos:scopeNote """

      This ontology defines IMF's meta model which defines how
      IMF models are represented.

    """;
    #skos:editorialNote """
    #""";
    .

<<owl-metamodel-aspectobject>>
<<owl-metamodel-terminal>>
<<owl-metamodel-system>>
<<owl-metamodel-transport>>
#+END_SRC

** Aspect object subtypes and their relations

#+NAME: owl-metamodel-aspectobject
#+BEGIN_SRC ttl
imf:AspectObject a owl:Class ;

  skos:scopeNote """

    Each aspect object is either a ....""".

[] ottr:of o-owl-ma:ClassPartition ;
   ottr:values ( imf:AspectObject ( imf:SystemBlock imf:Terminal imf:Transport )) .
#+END_SRC

