imf-ontology-source.html

<div id="outline-container-orgcdc7ce0" class="outline-4">
<h4 id="orgcdc7ce0"><span class="section-number-4">5.1.3</span> Terminal/Port</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
A terminal is a port/boundary point with which a system or a transport
is connected to other systems or transports.
</p>

<p>
Like systems, a terminal can be further specified through
sub/part/child terminals.
</p>

<p>
Question: 
</p>
<ul class="org-ul">
<li>Can a terminal be shared between a parent and a child system? I
imagine that a system can be broken down, but that the terminal
does not need to be.</li>
</ul>
</div>
</div>

<div id="outline-container-org526503f" class="outline-4">
<h4 id="org526503f"><span class="section-number-4">5.1.4</span> Connection</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
A connection connects two terminals. A connection is used for
representing data about the connection, e.g., the force with which the
terminals can be disconnected.
</p>

<p>
? A connection can have system as children?
</p>

<p>
Questions:
</p>
<ul class="org-ul">
<li>Can a connection have a parent? Maybe not? It is necessary to
have a parent?</li>
</ul>
</div>
</div>

<div id="outline-container-org2c9b540" class="outline-4">
<h4 id="org2c9b540"><span class="section-number-4">5.1.5</span> Stream</h4>
<div class="outline-text-4" id="text-5-1-5">
<p>
Continuous
</p>

<p>
A stream represents a medium, a matter, abstact or concrete, which is
processed by a system. A stream "flows" between systems.
</p>

<p>
For streams, systems represent points where the number of terminals of
the system determines if and how the stream may be rearranged, i.e.,
split or joined or a combination. Since transports have exactly two
terminals, a transport does not need to be considered
</p>

<p>
A stream may be split up into connected sections/segments. ?-&gt; Are not
these also just streams?
</p>

<p>
The relation between a stream and the system it is processed by or
flows though, is "contained by" &#x2013; or a different word? 
</p>
<ul class="org-ul">
<li>"eier" eller "har ansvar for"</li>
</ul>

<p>
Questions:
</p>
<ul class="org-ul">
<li>It is useful to identify points in the stream, e.g., the start and
end of a stream. Should we call this a cross section, or is it just
a stream &#x2013; or perhaps a stream boundary?</li>
<li>Can a stream be contained by a system, a transport, a terminal
and/or a connection?</li>
<li>Can a stram be contained by multiple transports, e.g., some water
may flow in multiple paralell pipes, or must the stream then be
split into multiple streams to represent this?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd7f6a54" class="outline-3">
<h3 id="orgd7f6a54"><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> Processing and QA&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QA">QA</span></span></h3>
<div class="outline-text-3" id="text-5-2">
<p>
TODO: copy from other ontologies once this ontology has settled.
</p>

<p>
This is placed here so that it is easier to syncronise filenames with
org-mode tangled files.
</p>

<pre class="example">
12:04:57 INFO  riot            :: File: .imf-metamodel.wottr
.imf-metamodel.wottr : 0.21 sec : 60 Triples : 288.46 per second
12:04:58 INFO  riot            :: File: imf-metamodel.owl.ttl
imf-metamodel.owl.ttl : 0.01 sec : 55 Triples : 6,111.11 per second
Total           : 0.22 sec : 115 Triples : 529.95 per second

</pre>

<pre class="example">
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/DomainRange

[INFO] Fetched template http://tpl.ottr.xyz/rdf/0.1/Type

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectUnionOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubClassOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/TypedListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivalentClass

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/AllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/HasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ValueRestriction

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/macro/0.1/ClassPartition
[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/ClassPartition
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectUnionOf
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/DisjointClasses

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank505 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank505 : LUB&lt;rdfs:Resource&gt;, owl:members : LUB ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank506 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank506 : LUB&lt;rdfs:Resource&gt;, owl:unionOf : LUB ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank506 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#AspectObject : LUB&lt;ottr: ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#AspectObject : LUB&lt;ottr: ...

[WARNING] Fetch missing template: http://ns.ottr.xyz/0.4/NullableTriple
[WARNING] Failed fetch for template http://ns.ottr.xyz/0.4/NullableTriple

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:NullableTriple(http://ns.imfid.org/imf#SystemBlock : LU ...
rapper: Parsing URI file:///home/martige/repo/imf-lab/imf-ontology/.imf-metamodel.wottr.temp with parser turtle
rapper: Serializing with serializer turtle
rapper: Parsing returned 59 triples
</pre>
</div>
</div>


<div id="outline-container-org9a4b0f0" class="outline-3">
<h3 id="org9a4b0f0"><span class="section-number-3">5.3</span> Ontology header</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-ttl" id="orge5de57d">

&lt;http://ns.imfid.org/imf-metamodel&gt; a owl:Ontology ;
    owl:versionIRI &lt;http://ns.imfid.org/ontology/2022-01-31/imf-metamodel&gt; ;
    owl:imports &lt;http://ns.imfid.org/ontology/2022-01-31/imf-top&gt; ;
    skos:prefLabel "Information Modelling Framework Ontology: Metamodel Ontology " ;
    skos:altLabel "IMF metamodel ontology" ;
    skos:scopeNote """

      This ontology defines IMF's meta model which defines how
      IMF models are represented.

    """;
    #skos:editorialNote """
    #""";
    .





</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4d18ec" class="outline-3">
<h3 id="orgc4d18ec"><span class="section-number-3">5.4</span> Aspect object subtypes and their relations</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-ttl" id="org9768c9d">imf:AspectObject a owl:Class ;

  skos:scopeNote """

    Each aspect object is either a ....""".

[] ottr:of o-owl-ma:ClassPartition ;
   ottr:values ( imf:AspectObject ( imf:SystemBlock imf:Terminal imf:Transport )) .
</pre>
</div>
</div>
