imf-ontology-source.org
*** Terminal

#+NAME: owl-metamodel-terminal
#+BEGIN_SRC ttl
imf:Terminal a owl:Class ;

  ### annotations

  skos:prefLabel "Terminal";
  
  #skos:altLabel "";

  skos:definition """

    A terminal represents a point/port/boundry of
    connection/communication for exactly one system block or a
    stream. System blocks and streams may only be connected to other
    system blocks and streams via their terminals.

  """;

  skos:scopeNote """

    System blocks and streams are not directly connected, but
    (indirectly) connected through their terminals. Direct connections
    between aspect objects are only permissible between terminals and
    system blocks, terminals and streams, and between
    terminals. Direct connections between terminals form indirect
    connections between the aspect objects to which terminal acts as
    terminal for.

    Furthermore, such indirect connections are only permissible
    between system block and streams, and between streams.

    A terminal may have a direction which may either be in, out or
    bi-directional. In-terminals may only be connected to
    out-terminals (and vise versa), while bi-terminals may only be
    connected to bi-terminals.
  """;

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  .

  ### axioms

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:BiTerminal imf:isConnectedTo imf:BiTerminal ) .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:InTerminal imf:isConnectedTo imf:OutTerminal ) .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:OutTerminal imf:isConnectedTo imf:InTerminal ) .

[] ottr:of o-owl-ax:DisjointClasses ;
   ottr:values ( ( imf:BiTerminal imf:InTerminal imf:OutTerminal ) ) .

#+END_SRC

*** System block

#+NAME: owl-metamodel-system
#+BEGIN_SRC ttl
imf:SystemBlock a owl:Class ;

  ### annotations

  #skos:prefLabel "";
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  #skos:scopeNote """
  #""";

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  .

  ### axioms
#+END_SRC

*** Transport

#+NAME: owl-metamodel-transport
#+BEGIN_SRC ttl
imf:Transport a owl:Class ;

  ### annotations

  #skos:prefLabel "";
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  #skos:scopeNote """
  #""";

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  .

  ### axioms
#+END_SRC

*** TODO left-overs

The relationships that form the structure between the different aspect
objects are all intra-aspect relationships, meaning they relate aspect
objects of the same aspect.

#+BEGIN_SRC ttl
imf:SystemBlock
    a owl:Class ;
    , [
        a owl:Restriction ;
        owl:allValuesFrom imf:SystemBlock ;
        owl:onProperty imf:hasChild
    ] .

imf:Terminal
    a owl:Class ;
    rdfs:subClassOf imf:AspectObject, [
        a owl:Restriction ;
        owl:allValuesFrom imf:Terminal ;
        owl:onProperty imf:hasChild
    ] .

imf:Transport
    a owl:Class ;
    rdfs:subClassOf imf:AspectObject, [
        a owl:Restriction ;
        owl:onProperty imf:hasActivity ;
        owl:someValuesFrom owl:Thing
    ], [
        a owl:Restriction ;
        owl:allValuesFrom imf:Transport ;
        owl:onProperty imf:hasChild
    ], [
        a owl:Restriction ;
        owl:onClass imf:Terminal ;
        owl:onProperty imf:hasTerminal ;
        owl:qualifiedCardinality "2"^^xsd:nonNegativeInteger
    ] .

imf:Interface
    a owl:Class ;
    rdfs:subClassOf imf:AspectObject, [
        a owl:Class ;
        owl:complementOf [
            a owl:Restriction ;
            owl:onProperty imf:hasActivity ;
            owl:someValuesFrom owl:Thing
        ]
    ], [
        a owl:Restriction ;
        owl:allValuesFrom imf:Interface ;
        owl:onProperty imf:hasChild
    ], [
        a owl:Restriction ;
        owl:onClass imf:Terminal ;
        owl:onProperty imf:hasTerminal ;
        owl:qualifiedCardinality "2"^^xsd:nonNegativeInteger
    ] .
#+END_SRC

#+BEGIN_SRC ttl
imf:hasTerminal
    a owl:InverseFunctionalProperty, owl:ObjectProperty; 
    rdfs:domain [
        a owl:Class ;
        owl:unionOf (imf:Interface
            imf:SystemBlock
            imf:Transport
        )
    ] ;
    rdfs:range imf:Terminal ;
    rdfs:subPropertyOf imf:intraAspectRelation .


imf:isDirectlyConnectedTo a owl:ObjectProperty ;
	rdfs:subPropertyOf imf:isConnectedTo , skos:related ;
	a owl:FunctionalProperty , owl:InverseFunctionalProperty ;
	rdfs:domain imf:Terminal ;
	rdfs:range imf:Terminal .


imf:isConnectedTo
    a owl:FunctionalProperty, owl:InverseFunctionalProperty, owl:ObjectProperty ;
    rdfs:domain imf:Terminal ;
    rdfs:range imf:Terminal ;
    rdfs:subPropertyOf imf:intraAspectRelation .
#+END_SRC

#+BEGIN_SRC ttl
imf:StreamTerminal
    a owl:Class ;
    owl:equivalentClass [
        a owl:Class ;
        owl:intersectionOf (imf:Terminal
            [
                a owl:Restriction ;
                owl:onProperty [
                    owl:inverseOf imf:hasTerminal
                ] ;
                owl:someValuesFrom [
                    a owl:Class ;
                    owl:unionOf (imf:Interface
                        imf:Transport
                    )
                ]
            ]
        )
    ] .

imf:SystemBlockTerminal
    a owl:Class ;
    rdfs:subClassOf [
        a owl:Restriction ;
        owl:allValuesFrom imf:StreamTerminal ;
        owl:onProperty imf:isConnectedTo
    ] ;
    owl:equivalentClass [
        a owl:Class ;
        owl:intersectionOf (imf:Terminal
            [
                a owl:Restriction ;
                owl:onProperty [
                    owl:inverseOf imf:hasTerminal
                ] ;
                owl:someValuesFrom imf:SystemBlock
            ]
        )
    ] .
#+END_SRC

* IMF Aspects Ontology
** Processing and QA                                                     :QA:

This is placed here so that it is easier to syncronise filenames with
org-mode tangled files.

*** RDF validate tangled file

#+CALL: sh_jena_validate_rdf(files=".imf-aspects.wottr")

#+RESULTS:
: 15:38:57 INFO  riot            :: File: .imf-aspects.wottr
: .imf-aspects.wottr : 0.25 sec : 162 Triples : 637.80 per second
: 15:38:57 INFO  riot            :: File: imf-aspects.owl
: imf-aspects.owl : 0.02 sec : 149 Triples : 8,277.78 per second
: Total           : 0.27 sec : 311 Triples : 1,143.38 per second


