imf-ontology-source.html

<div id="outline-container-org38b3b72" class="outline-4">
<h4 id="org38b3b72"><span class="section-number-4">5.4.1</span> Terminal</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">
<pre class="src src-ttl" id="org2cde169">imf:Terminal a owl:Class ;

  ### annotations

  skos:prefLabel "Terminal";
  
  #skos:altLabel "";

  skos:definition """

    A terminal represents a point/port/boundry of
    connection/communication for exactly one system block or a
    stream. System blocks and streams may only be connected to other
    system blocks and streams via their terminals.

  """;

  skos:scopeNote """

    System blocks and streams are not directly connected, but
    (indirectly) connected through their terminals. Direct connections
    between aspect objects are only permissible between terminals and
    system blocks, terminals and streams, and between
    terminals. Direct connections between terminals form indirect
    connections between the aspect objects to which terminal acts as
    terminal for.

    Furthermore, such indirect connections are only permissible
    between system block and streams, and between streams.

    A terminal may have a direction which may either be in, out or
    bi-directional. In-terminals may only be connected to
    out-terminals (and vise versa), while bi-terminals may only be
    connected to bi-terminals.
  """;

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  .

  ### axioms

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:BiTerminal imf:isConnectedTo imf:BiTerminal ) .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:InTerminal imf:isConnectedTo imf:OutTerminal ) .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:OutTerminal imf:isConnectedTo imf:InTerminal ) .

[] ottr:of o-owl-ax:DisjointClasses ;
   ottr:values ( ( imf:BiTerminal imf:InTerminal imf:OutTerminal ) ) .

</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb2aacd" class="outline-4">
<h4 id="orgeb2aacd"><span class="section-number-4">5.4.2</span> System block</h4>
<div class="outline-text-4" id="text-5-4-2">
<div class="org-src-container">
<pre class="src src-ttl" id="orgdcba86c">imf:SystemBlock a owl:Class ;

  ### annotations

  #skos:prefLabel "";
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  #skos:scopeNote """
  #""";

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  .

  ### axioms
</pre>
</div>
</div>
</div>

<div id="outline-container-org2074f00" class="outline-4">
<h4 id="org2074f00"><span class="section-number-4">5.4.3</span> Transport</h4>
<div class="outline-text-4" id="text-5-4-3">
<div class="org-src-container">
<pre class="src src-ttl" id="org7341d22">imf:Transport a owl:Class ;

  ### annotations

  #skos:prefLabel "";
  
  #skos:altLabel "";

  #skos:definition """
  #""";

  #skos:scopeNote """
  #""";

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  .

  ### axioms
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ad0889" class="outline-4">
<h4 id="org9ad0889"><span class="section-number-4">5.4.4</span> <span class="todo TODO">TODO</span> left-overs</h4>
<div class="outline-text-4" id="text-5-4-4">
<p>
The relationships that form the structure between the different aspect
objects are all intra-aspect relationships, meaning they relate aspect
objects of the same aspect.
</p>

<div class="org-src-container">
<pre class="src src-ttl">imf:SystemBlock
    a owl:Class ;
    , [
        a owl:Restriction ;
        owl:allValuesFrom imf:SystemBlock ;
        owl:onProperty imf:hasChild
    ] .

imf:Terminal
    a owl:Class ;
    rdfs:subClassOf imf:AspectObject, [
        a owl:Restriction ;
        owl:allValuesFrom imf:Terminal ;
        owl:onProperty imf:hasChild
    ] .

imf:Transport
    a owl:Class ;
    rdfs:subClassOf imf:AspectObject, [
        a owl:Restriction ;
        owl:onProperty imf:hasActivity ;
        owl:someValuesFrom owl:Thing
    ], [
        a owl:Restriction ;
        owl:allValuesFrom imf:Transport ;
        owl:onProperty imf:hasChild
    ], [
        a owl:Restriction ;
        owl:onClass imf:Terminal ;
        owl:onProperty imf:hasTerminal ;
        owl:qualifiedCardinality "2"^^xsd:nonNegativeInteger
    ] .

imf:Interface
    a owl:Class ;
    rdfs:subClassOf imf:AspectObject, [
        a owl:Class ;
        owl:complementOf [
            a owl:Restriction ;
            owl:onProperty imf:hasActivity ;
            owl:someValuesFrom owl:Thing
        ]
    ], [
        a owl:Restriction ;
        owl:allValuesFrom imf:Interface ;
        owl:onProperty imf:hasChild
    ], [
        a owl:Restriction ;
        owl:onClass imf:Terminal ;
        owl:onProperty imf:hasTerminal ;
        owl:qualifiedCardinality "2"^^xsd:nonNegativeInteger
    ] .
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ttl">imf:hasTerminal
    a owl:InverseFunctionalProperty, owl:ObjectProperty; 
    rdfs:domain [
        a owl:Class ;
        owl:unionOf (imf:Interface
            imf:SystemBlock
            imf:Transport
        )
    ] ;
    rdfs:range imf:Terminal ;
    rdfs:subPropertyOf imf:intraAspectRelation .


imf:isDirectlyConnectedTo a owl:ObjectProperty ;
	rdfs:subPropertyOf imf:isConnectedTo , skos:related ;
	a owl:FunctionalProperty , owl:InverseFunctionalProperty ;
	rdfs:domain imf:Terminal ;
	rdfs:range imf:Terminal .


imf:isConnectedTo
    a owl:FunctionalProperty, owl:InverseFunctionalProperty, owl:ObjectProperty ;
    rdfs:domain imf:Terminal ;
    rdfs:range imf:Terminal ;
    rdfs:subPropertyOf imf:intraAspectRelation .
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ttl">imf:StreamTerminal
    a owl:Class ;
    owl:equivalentClass [
        a owl:Class ;
        owl:intersectionOf (imf:Terminal
            [
                a owl:Restriction ;
                owl:onProperty [
                    owl:inverseOf imf:hasTerminal
                ] ;
                owl:someValuesFrom [
                    a owl:Class ;
                    owl:unionOf (imf:Interface
                        imf:Transport
                    )
                ]
            ]
        )
    ] .

imf:SystemBlockTerminal
    a owl:Class ;
    rdfs:subClassOf [
        a owl:Restriction ;
        owl:allValuesFrom imf:StreamTerminal ;
        owl:onProperty imf:isConnectedTo
    ] ;
    owl:equivalentClass [
        a owl:Class ;
        owl:intersectionOf (imf:Terminal
            [
                a owl:Restriction ;
                owl:onProperty [
                    owl:inverseOf imf:hasTerminal
                ] ;
                owl:someValuesFrom imf:SystemBlock
            ]
        )
    ] .
</pre>
</div>
</div>
</div>
</div>
</div>
