imf-ontology-source.org
*** Expand OTTR instances

#+CALL: lutra-expand(in=".imf-aspects.wottr", out="imf-aspects.owl.ttl")

#+RESULTS:
#+begin_example
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/DomainRange

[INFO] Fetched template http://tpl.ottr.xyz/rdf/0.1/Type

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectUnionOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubClassOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/TypedListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivalentClass

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/AllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/HasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ValueRestriction

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/macro/0.1/ClassPartition
[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/ClassPartition
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectUnionOf
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/DisjointClasses

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank507 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank507 : LUB<rdfs:Resource>, owl:members : LUB ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank508 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank508 : LUB<rdfs:Resource>, owl:unionOf : LUB ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank508 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#Aspect : LUB<ottr:IRI>,  ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#Aspect : LUB<ottr:IRI>,  ...

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/axiom/0.1/DifferentIndividuals
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/DifferentIndividuals

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank517 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank517 : LUB<rdfs:Resource>, owl:members : LUB ...

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectOneOf
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectOneOf
[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectOneOf

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank518 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank518 : LUB<rdfs:Resource>, owl:oneOf : LUB<o ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank518 : LUB<rdfs:Resource>, rdf:type : LUB<ot ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#PrimaryAspect : LUB<ottr ...
 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#PrimaryAspect : LUB<ottr ...

[WARNING] Fetch missing template: http://ns.ottr.xyz/0.4/NullableTriple
[WARNING] Failed fetch for template http://ns.ottr.xyz/0.4/NullableTriple

 >>> at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:NullableTriple(http://ns.imfid.org/imf#interAspectRelat ...
rapper: Parsing URI file:///home/martige/repo/imf-lab/imf-ontology/.imf-aspects.wottr.temp with parser turtle
rapper: Serializing with serializer turtle
rapper: Parsing returned 166 triples
#+end_example

*** RDF validate final file

#+CALL: sh_jena_validate_rdf(files="imf-aspects.owl.ttl")
#+CALL: sh_jena_shacl_validate_std-vocabulary(files="imf-aspects.owl.ttl")

#+RESULTS:
#+BEGIN_src ttl
@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sh:   <http://www.w3.org/ns/shacl#> .
@prefix xsd:  <http://www.w3.org/2001/XMLSchema#> .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .
#+END_src

** Ontology header

#+NAME: owl-aspect-ontology
#+BEGIN_SRC ttl :noweb strip-export :tangle .imf-aspects.wottr
<<prefixes>>

<http://ns.imfid.org/imf-aspects> a owl:Ontology ;
    owl:versionIRI <http://ns.imfid.org/ontology/2022-01-31/imf-aspects> ;
    owl:imports <http://ns.imfid.org/ontology/2022-01-31/imf-top> ;
    skos:prefLabel "Information Modelling Framework Ontology: Aspects Ontology " ;
    skos:altLabel "IMF aspects ontology" ;
    skos:scopeNote """

      This ontology defines IMF's central aspects.

    """;
    #skos:editorialNote """
    #""";
    .

<<owl-aspects-aspect>>
<<owl-aspects-primary>>
<<owl-aspects-secondary>>
<<py_aspect_ottr_instances_aspects()>>
<<owl-aspects-interaspectrelation>>
<<py_aspect_ottr_instances_interaspectrelations()>>
#+END_SRC

** Aspect classes
*** Aspect

#+NAME: owl-aspects-aspect
#+BEGIN_SRC ttl
imf:Aspect a owl:Class ;

  skos:scopeNote """

    Aspects are partitioned into primary and secondary aspects. The
    primary aspects are Function, Location and Product. All other
    aspects are secondary aspects.

  """;

  skos:scopeNote """

    Each aspect is associated with a class of the aspect objects that
    have that aspect, e.g,. imf:FunctionAspectObject is the class of
    aspect objects with the aspect imf:FunctionAspect. These classes
    are used to specify permissible relationships between aspect
    objects according to their aspect.""" ;

  #skos:editorialNote """
  #""";

  .

  ### axioms

[] ottr:of o-owl-ma:ClassPartition ;
   ottr:values ( imf:Aspect ( imf:PrimaryAspect imf:SecondaryAspect )) .
#+END_SRC

*** Primary Aspect

#+NAME: owl-aspects-primary
#+BEGIN_SRC ttl
imf:PrimaryAspect rdf:type owl:Class ;
  rdfs:subClassOf imf:Aspect ;

  ### annotations

  skos:prefLabel "Primary Aspect";
  #skos:altLabel "";

  skos:definition """

    The set of primary aspects are exactly those defined in ISO/IEC
    81346: Function, Location, Product.

  """;

  #skos:scopeNote """
  #

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  .

  ### axioms
[] ottr:of o-owl-ax:EquivObjectOneOf ;
   ottr:values ( imf:PrimaryAspect ( imf:FunctionAspect imf:LocationAspect imf:ProductAspect ) ) .
#+END_SRC

