imf-ontology-source.html

<div id="outline-container-org1bc86eb" class="outline-2">
<h2 id="org1bc86eb"><span class="section-number-2">6</span> IMF Aspects Ontology</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org9d4a86d" class="outline-3">
<h3 id="org9d4a86d"><span class="section-number-3">6.1</span> Processing and QA&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QA">QA</span></span></h3>
<div class="outline-text-3" id="text-6-1">
<p>
This is placed here so that it is easier to syncronise filenames with
org-mode tangled files.
</p>
</div>

<div id="outline-container-org6893d2e" class="outline-4">
<h4 id="org6893d2e"><span class="section-number-4">6.1.1</span> RDF validate tangled file</h4>
<div class="outline-text-4" id="text-6-1-1">
<pre class="example">
.imf-aspects.wottr : 0.23 sec : 162 Triples : 710.53 per second

</pre>
</div>
</div>


<div id="outline-container-org1597980" class="outline-4">
<h4 id="org1597980"><span class="section-number-4">6.1.2</span> Expand OTTR instances</h4>
<div class="outline-text-4" id="text-6-1-2">
<pre class="example">
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/DomainRange

[INFO] Fetched template http://tpl.ottr.xyz/rdf/0.1/Type

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubObjectPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectUnionOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubClassOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectAllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/TypedListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivalentClass

[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/SubPropertyOf

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectHasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/AllValuesFrom

[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/HasValue

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ListRelation

[INFO] Fetched template http://tpl.ottr.xyz/owl/util/0.1/ValueRestriction

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/axiom/0.1/DifferentIndividuals
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/DifferentIndividuals

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank513 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank513 : LUB&lt;rdfs:Resource&gt;, owl:members : LUB ...

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/macro/0.1/ClassPartition
[INFO] Fetched template http://tpl.ottr.xyz/owl/macro/0.1/ClassPartition
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectUnionOf
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/DisjointClasses

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank514 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank514 : LUB&lt;rdfs:Resource&gt;, owl:members : LUB ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank515 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank515 : LUB&lt;rdfs:Resource&gt;, owl:unionOf : LUB ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank515 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#Aspect : LUB&lt;ottr:IRI&gt;,  ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#Aspect : LUB&lt;ottr:IRI&gt;,  ...

[INFO] Fetch missing template: http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectOneOf
[INFO] Fetched template http://tpl.ottr.xyz/owl/axiom/0.1/EquivObjectOneOf
[INFO] Fetched template http://tpl.ottr.xyz/owl/restriction/0.1/ObjectOneOf

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank520 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank520 : LUB&lt;rdfs:Resource&gt;, owl:oneOf : LUB&lt;o ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(blank520 : LUB&lt;rdfs:Resource&gt;, rdf:type : LUB&lt;ot ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#PrimaryAspect : LUB&lt;ottr ...
 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:Triple(http://ns.imfid.org/imf#PrimaryAspect : LUB&lt;ottr ...

[WARNING] Fetch missing template: http://ns.ottr.xyz/0.4/NullableTriple
[WARNING] Failed fetch for template http://ns.ottr.xyz/0.4/NullableTriple

 &gt;&gt;&gt; at [1: 1] (xyz.ottr.lutra.model.Instance) ottr:NullableTriple(http://ns.imfid.org/imf#interAspectRelat ...
rapper: Parsing URI file:///home/martige/repo/imf-lab/imf-ontology/.imf-aspects.wottr.temp with parser turtle
rapper: Serializing with serializer turtle
rapper: Parsing returned 166 triples
</pre>
</div>
</div>

<div id="outline-container-org94f10b9" class="outline-4">
<h4 id="org94f10b9"><span class="section-number-4">6.1.3</span> RDF validate final file</h4>
<div class="outline-text-4" id="text-6-1-3">
<pre class="example">
imf-aspects.owl.ttl : 0.23 sec : 149 Triples : 653.51 per second

</pre>

<div class="org-src-container">
<pre class="src src-ttl">@prefix rdf:  &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix sh:   &lt;http://www.w3.org/ns/shacl#&gt; .
@prefix xsd:  &lt;http://www.w3.org/2001/XMLSchema#&gt; .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga50693b" class="outline-3">
<h3 id="orga50693b"><span class="section-number-3">6.2</span> Ontology header</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-ttl" id="org26f3cb4">

&lt;http://ns.imfid.org/imf-aspects&gt; a owl:Ontology ;
    owl:versionIRI &lt;http://ns.imfid.org/ontology/2022-01-31/imf-aspects&gt; ;
    owl:imports &lt;http://ns.imfid.org/ontology/2022-01-31/imf-top&gt; ;
    skos:prefLabel "Information Modelling Framework Ontology: Aspects Ontology " ;
    skos:altLabel "IMF aspects ontology" ;
    skos:scopeNote """

      This ontology defines IMF's central aspects.

    """;
    #skos:editorialNote """
    #""";
    .







</pre>
</div>
</div>
</div>

<div id="outline-container-orge1c73b7" class="outline-3">
<h3 id="orge1c73b7"><span class="section-number-3">6.3</span> Aspect classes</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-org75aae70" class="outline-4">
<h4 id="org75aae70"><span class="section-number-4">6.3.1</span> Aspect</h4>
<div class="outline-text-4" id="text-6-3-1">
<div class="org-src-container">
<pre class="src src-ttl" id="org57097c1">imf:Aspect a owl:Class ;

  skos:scopeNote """

    Aspects are partitioned into primary and secondary aspects. The
    primary aspects are Function, Location and Product. All other
    aspects are secondary aspects.

  """;

  skos:scopeNote """

    Each aspect is associated with a class of the aspect objects that
    have that aspect, e.g,. imf:FunctionAspectObject is the class of
    aspect objects with the aspect imf:FunctionAspect. These classes
    are used to specify permissible relationships between aspect
    objects according to their aspect.""" ;

  #skos:editorialNote """
  #""";

  .

  ### axioms

[] ottr:of o-owl-ma:ClassPartition ;
   ottr:values ( imf:Aspect ( imf:PrimaryAspect imf:SecondaryAspect )) .
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcff5c36" class="outline-4">
<h4 id="orgcff5c36"><span class="section-number-4">6.3.2</span> Primary Aspect</h4>
<div class="outline-text-4" id="text-6-3-2">
<div class="org-src-container">
<pre class="src src-ttl" id="orgce04cd7">imf:PrimaryAspect rdf:type owl:Class ;
  rdfs:subClassOf imf:Aspect ;

  ### annotations

  skos:prefLabel "Primary Aspect";
  #skos:altLabel "";

  skos:definition """

    The set of primary aspects are exactly those defined in ISO/IEC
    81346: Function, Location, Product.

  """;

  #skos:scopeNote """
  #

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  .

  ### axioms
[] ottr:of o-owl-ax:EquivObjectOneOf ;
   ottr:values ( imf:PrimaryAspect ( imf:FunctionAspect imf:LocationAspect imf:ProductAspect ) ) .
</pre>
</div>
</div>
</div>
