imf-ontology-source.org
*** Secondary Aspect

#+NAME: owl-aspects-secondary
#+BEGIN_SRC ttl
imf:SecondaryAspect rdf:type owl:Class ;
  rdfs:subClassOf imf:Aspect ;

  skos:prefLabel "Secondary Aspect";
  #skos:altLabel "";

  skos:definition """

    Secondary aspects are those aspects that are not primary aspects.

  """;

  #skos:scopeNote """
  #""";

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  ### axioms

  owl:disjointWith imf:PrimaryAspect .
#+END_SRC

** Aspects

#+NAME: tbl-aspects
 | Aspect, IRIs        | Prefix, List of strings | Color, string |
 |---------------------+-------------------------+---------------|
 | imf:FunctionAspect  | ('=')                   | '#FFFF00'     |
 | imf:LocationAspect  | ('+' '++')              | '#FF00FF'     |
 | imf:ProductAspect   | ('-')                   | '#00FFFF'     |
 | imf:InstalledAspect | ('::')                  | '#3232BD'     |

#+BEGIN_SRC ttl :noweb strip-export :tangle tpl/aspects.stottr :mkdirp yes
<<prefixes>>

o-imf:Aspect [owl:NamedIndividual ?aspect, List<xsd:string> ?symbol, xsd:string ?color] :: {
  o-rdf:Type(?aspect, imf:Aspect) ,
  cross | ottr:Triple(?aspect, imf:prefix, ++?symbol),
  ottr:Triple(?aspect, imf:color, ?color)
} .

o-imf:AspectObjectClass [owl:Class ?class, owl:NamedIndividual ?aspect] :: {
  o-owl-ax:EquivObjectHasValue(?class, imf:hasAspect, ?aspect),  
  o-owl-ax:SubObjectAllValuesFrom(?class, imf:intraAspectRelation, ?class)
} .
#+END_SRC

#+NAME: py_aspect_ottr_instances_aspects
#+BEGIN_SRC python :results raw :wrap src ttl :var table=tbl-aspects :exports none
output = ""

instance = "[] ottr:of {} ;\n   ottr:values( {} ) . \n"

## aspects
for row in table[0:]:
  output += instance.format("o-imf:Aspect", " ".join(f'{w}' for w in row))

output += "\n"

all_aspects = list(zip(*table[0:]))[0]

## aspects are different
output += instance.format("o-owl-ax:DifferentIndividuals", "( " + " ".join(all_aspects) + " )")

output += "\n"

## aspect object classes
for cell in all_aspects:
  output += instance.format("o-imf:AspectObjectClass", cell + "Object " + cell)

return output
#+END_SRC

#+RESULTS: py_aspect_ottr_instances_aspects
#+BEGIN_src ttl
[] ottr:of o-imf:Aspect ;
   ottr:values( imf:FunctionAspect ('=') '#FFFF00' ) . 
[] ottr:of o-imf:Aspect ;
   ottr:values( imf:LocationAspect ('+' '++') '#FF00FF' ) . 
[] ottr:of o-imf:Aspect ;
   ottr:values( imf:ProductAspect ('-') '#00FFFF' ) . 
[] ottr:of o-imf:Aspect ;
   ottr:values( imf:InstalledAspect ('::') '#3232BD' ) . 

[] ottr:of o-owl-ax:DifferentIndividuals ;
   ottr:values( ( imf:FunctionAspect imf:LocationAspect imf:ProductAspect imf:InstalledAspect ) ) . 

[] ottr:of o-imf:AspectObjectClass ;
   ottr:values( imf:FunctionAspectObject imf:FunctionAspect ) . 
[] ottr:of o-imf:AspectObjectClass ;
   ottr:values( imf:LocationAspectObject imf:LocationAspect ) . 
[] ottr:of o-imf:AspectObjectClass ;
   ottr:values( imf:ProductAspectObject imf:ProductAspect ) . 
[] ottr:of o-imf:AspectObjectClass ;
   ottr:values( imf:InstalledAspectObject imf:InstalledAspect ) . 
#+END_src

** Inter-aspect relationships

#+NAME: owl-aspects-interaspectrelation
#+BEGIN_SRC ttl
imf:interAspectRelation a owl:ObjectProperty ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject ;
    rdfs:subPropertyOf skos:related ;
    owl:propertyDisjointWith imf:intraAspectRelation ;
    skos:editorialNote """

      [2022-01-24 Mon] Do interAspectRelations always relate aspect
      objects of the same type?""" .
#+END_SRC

Aspect objects of different aspects are related by inter aspect
relationships. The following relationships are permissible:

#+NAME: tbl_interaspectrelations
 | Relation          | Domain, comma seperated list = union  | Range, comma seperated list =  union |
 |-------------------+---------------------------------------+--------------------------------------|
 | imf:hasLocation   | imf:FunctionAspect, imf:ProductAspect | imf:LocationAspect                   |
 | imf:isFulfilledBy | imf:FunctionAspect                    | imf:ProductAspect                    |
 | imf:isInstalledAs | imf:ProductAspect                     | imf:InstalledAspect                  |

#+BEGIN_SRC ttl :noweb strip-export :tangle tpl/interaspectrelations.stottr :mkdirp yes
<<prefixes>>

o-imf:InterAspectRelation[owl:ObjectProperty ?relation, List<owl:Class> ?domain, List<owl:Class> ?range] :: {
  o-owl-ax:SubObjectPropertyOf(?relation, imf:interAspectRelation),
  o-owl-rstr:ObjectUnionOf(_:domain, ?domain),  
  o-owl-rstr:ObjectUnionOf(_:range, ?range),
  o-owl-ma:DomainRange(?relation, _:domain, _:range)
} .
#+END_SRC

#+NAME: py_aspect_ottr_instances_interaspectrelations
#+BEGIN_SRC python :results raw :wrap src ttl :var table=tbl_interaspectrelations :exports none
output = ""
instance = "[] ottr:of {} ;\n   ottr:values( {} ) . \n"

for row in table:
  output += instance.format("o-imf:InterAspectRelation", str(row[0]) 
    + " (" + " ".join(map(lambda x : x + "Object", row[1].split(","))) + ")"
    + " (" + " ".join(map(lambda x : x + "Object", row[2].split(","))) + ")")

return output
#+END_SRC

#+RESULTS: py_aspect_ottr_instances_interaspectrelations
#+BEGIN_src ttl
[] ottr:of o-imf:InterAspectRelation ;
   ottr:values( imf:hasLocation (imf:FunctionAspectObject  imf:ProductAspectObject) (imf:LocationAspectObject) ) . 
[] ottr:of o-imf:InterAspectRelation ;
   ottr:values( imf:isFulfilledBy (imf:FunctionAspectObject) (imf:ProductAspectObject) ) . 
[] ottr:of o-imf:InterAspectRelation ;
   ottr:values( imf:isInstalledAs (imf:ProductAspectObject) (imf:InstalledAspectObject) ) . 
#+END_src

* Summary of IMF ontologies
