imf-ontology-source.html

<div id="outline-container-org1ca69c7" class="outline-4">
<h4 id="org1ca69c7"><span class="section-number-4">6.3.3</span> Secondary Aspect</h4>
<div class="outline-text-4" id="text-6-3-3">
<div class="org-src-container">
<pre class="src src-ttl" id="org7219c45">imf:SecondaryAspect rdf:type owl:Class ;
  rdfs:subClassOf imf:Aspect ;

  skos:prefLabel "Secondary Aspect";
  #skos:altLabel "";

  skos:definition """

    Secondary aspects are those aspects that are not primary aspects.

  """;

  #skos:scopeNote """
  #""";

  #skos:example """
  #""";

  #skos:editorialNote """
  #""";

  ### axioms

  owl:disjointWith imf:PrimaryAspect .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb4c05b8" class="outline-3">
<h3 id="orgb4c05b8"><span class="section-number-3">6.4</span> Aspects</h3>
<div class="outline-text-3" id="text-6-4">
<table id="org465286f" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspect, IRIs</th>
<th scope="col" class="org-left">Prefix, List of strings</th>
<th scope="col" class="org-left">Color, string</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">imf:FunctionAspect</td>
<td class="org-left">('=')</td>
<td class="org-left">'#FFFF00'</td>
</tr>

<tr>
<td class="org-left">imf:LocationAspect</td>
<td class="org-left">('<del>' '+</del>')</td>
<td class="org-left">'#FF00FF'</td>
</tr>

<tr>
<td class="org-left">imf:ProductAspect</td>
<td class="org-left">('-')</td>
<td class="org-left">'#00FFFF'</td>
</tr>

<tr>
<td class="org-left">imf:InstalledAspect</td>
<td class="org-left">('::')</td>
<td class="org-left">'#3232BD'</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-ttl">

o-imf:Aspect [owl:NamedIndividual ?aspect, List&lt;xsd:string&gt; ?symbol, xsd:string ?color] :: {
  o-rdf:Type(?aspect, imf:Aspect) ,
  cross | ottr:Triple(?aspect, imf:prefix, ++?symbol),
  ottr:Triple(?aspect, imf:color, ?color)
} .

o-imf:AspectObjectClass [owl:Class ?class, owl:NamedIndividual ?aspect] :: {
  o-owl-ax:EquivObjectHasValue(?class, imf:hasAspect, ?aspect),  
  o-owl-ax:SubObjectAllValuesFrom(?class, imf:intraAspectRelation, ?class)
} .
</pre>
</div>
</div>
</div>

<div id="outline-container-orge022002" class="outline-3">
<h3 id="orge022002"><span class="section-number-3">6.5</span> Inter-aspect relationships</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-ttl" id="orgd7c9311">imf:interAspectRelation a owl:ObjectProperty ;
    rdfs:domain imf:AspectObject ;
    rdfs:range imf:AspectObject ;
    rdfs:subPropertyOf skos:related ;
    owl:propertyDisjointWith imf:intraAspectRelation ;
    skos:editorialNote """

      [2022-01-24 Mon] Do interAspectRelations always relate aspect
      objects of the same type?""" .
</pre>
</div>

<p>
Aspect objects of different aspects are related by inter aspect
relationships. The following relationships are permissible:
</p>

<table id="org605b19e" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Relation</th>
<th scope="col" class="org-left">Domain, comma seperated list = union</th>
<th scope="col" class="org-left">Range, comma seperated list =  union</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">imf:hasLocation</td>
<td class="org-left">imf:FunctionAspect, imf:ProductAspect</td>
<td class="org-left">imf:LocationAspect</td>
</tr>

<tr>
<td class="org-left">imf:isFulfilledBy</td>
<td class="org-left">imf:FunctionAspect</td>
<td class="org-left">imf:ProductAspect</td>
</tr>

<tr>
<td class="org-left">imf:isInstalledAs</td>
<td class="org-left">imf:ProductAspect</td>
<td class="org-left">imf:InstalledAspect</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-ttl">

o-imf:InterAspectRelation[owl:ObjectProperty ?relation, List&lt;owl:Class&gt; ?domain, List&lt;owl:Class&gt; ?range] :: {
  o-owl-ax:SubObjectPropertyOf(?relation, imf:interAspectRelation),
  o-owl-rstr:ObjectUnionOf(_:domain, ?domain),  
  o-owl-rstr:ObjectUnionOf(_:range, ?range),
  o-owl-ma:DomainRange(?relation, _:domain, _:range)
} .
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org74e8161" class="outline-2">
<h2 id="org74e8161"><span class="section-number-2">7</span> Summary of IMF ontologies</h2>
<div class="outline-text-2" id="text-7">
</div>
