imf-ontology-source.org
** Classes

#+NAME: sparql_class
#+BEGIN_SRC ttl
SELECT ?class ?prefLabel ?altLabels ?definition ?superclasses
{
  ?class a owl:Class.
  FILTER (!isBlank(?class))

  OPTIONAL { ?class skos:prefLabel ?prefLabel }
  OPTIONAL { ?class skos:definition ?definition }

  { SELECT ?class 
      (GROUP_CONCAT(?superclass; SEPARATOR=", ") AS ?superclasses) 
      (GROUP_CONCAT(?altLabel; SEPARATOR=", ") AS ?altLabels) 
    {
      OPTIONAL { ?class rdfs:subClassOf ?superclass }
      OPTIONAL { ?class skos:altLabel ?altLabel }
    } GROUP BY ?class
  }

}
ORDER BY ?class
#+END_SRC


#+CALL: py_run_sparql(query=sparql_class)

#+RESULTS:
| ~class~                     | ~prefLabel~         | ~altLabels~ | ~definition~                                                                                                                                                                                                               | ~superclasses~            |
|-----------------------------+---------------------+-------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------|
| ~imf:Aspect~                | ~Aspect~            |             |                                                                                                                                                                                                                            |                           |
| ~imf:AspectObject~          | ~Aspect Object~     |             | ~An aspect object describes a specific type of feature (or aspect) of one (and exactly one) integrated object.~                                                                                                            | ~ub1bL338C21, ub1bL342C9~ |
| ~imf:BiTerminal~            |                     |             |                                                                                                                                                                                                                            | ~ub1bL126C21~             |
| ~imf:FunctionAspectObject~  |                     |             |                                                                                                                                                                                                                            | ~ub1bL225C21~             |
| ~imf:InTerminal~            |                     |             |                                                                                                                                                                                                                            | ~ub1bL131C21~             |
| ~imf:InstalledAspectObject~ |                     |             |                                                                                                                                                                                                                            | ~ub1bL140C21~             |
| ~imf:IntegratedObject~      | ~Integrated Object~ |             |                                                                                                                                                                                                                            |                           |
| ~imf:LocationAspectObject~  |                     |             |                                                                                                                                                                                                                            | ~ub1bL149C21~             |
| ~imf:OutTerminal~           |                     |             |                                                                                                                                                                                                                            | ~ub1bL158C21~             |
| ~imf:PrimaryAspect~         | ~Primary Aspect~    |             | ~The set of primary aspects are exactly those defined in ISO/IEC 81346: Function, Location, Product.~                                                                                                                      | ~imf:Aspect~              |
| ~imf:ProductAspectObject~   |                     |             |                                                                                                                                                                                                                            | ~ub1bL288C21~             |
| ~imf:SecondaryAspect~       | ~Secondary Aspect~  |             | ~Secondary aspects are those aspects that are not primary aspects.~                                                                                                                                                        | ~imf:Aspect~              |
| ~imf:SystemBlock~           |                     |             |                                                                                                                                                                                                                            |                           |
| ~imf:Terminal~              | ~Terminal~          |             | ~A terminal represents a point/port/boundry of connection/communication for exactly one system block or a stream. System blocks and streams may only be connected to other system blocks and streams via their terminals.~ |                           |
| ~imf:Transport~             |                     |             |                                                                                                                                                                                                                            |                           |

