imf-ontology-source.html
<div id="outline-container-org2164168" class="outline-3">
<h3 id="org2164168"><span class="section-number-3">7.1</span> Classes</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-ttl" id="org5c61170">SELECT ?class ?prefLabel ?altLabels ?definition ?superclasses
{
  ?class a owl:Class.
  FILTER (!isBlank(?class))

  OPTIONAL { ?class skos:prefLabel ?prefLabel }
  OPTIONAL { ?class skos:definition ?definition }

  { SELECT ?class 
      (GROUP_CONCAT(?superclass; SEPARATOR=", ") AS ?superclasses) 
      (GROUP_CONCAT(?altLabel; SEPARATOR=", ") AS ?altLabels) 
    {
      OPTIONAL { ?class rdfs:subClassOf ?superclass }
      OPTIONAL { ?class skos:altLabel ?altLabel }
    } GROUP BY ?class
  }

}
ORDER BY ?class
</pre>
</div>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>class</code></th>
<th scope="col" class="org-left"><code>prefLabel</code></th>
<th scope="col" class="org-left"><code>altLabels</code></th>
<th scope="col" class="org-left"><code>definition</code></th>
<th scope="col" class="org-left"><code>superclasses</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>imf:Aspect</code></td>
<td class="org-left"><code>Aspect</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>Aspect Object</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>An aspect object describes a specific type of feature (or aspect) of one (and exactly one) integrated object.</code></td>
<td class="org-left"><code>ub1bL342C9, ub1bL338C21</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:BiTerminal</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL126C21</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:FunctionAspectObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL225C21</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:InTerminal</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL131C21</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:InstalledAspectObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL140C21</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:IntegratedObject</code></td>
<td class="org-left"><code>Integrated Object</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>imf:LocationAspectObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL149C21</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:OutTerminal</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL158C21</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:PrimaryAspect</code></td>
<td class="org-left"><code>Primary Aspect</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>The set of primary aspects are exactly those defined in ISO/IEC 81346: Function, Location, Product.</code></td>
<td class="org-left"><code>imf:Aspect</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:ProductAspectObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL288C21</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:SecondaryAspect</code></td>
<td class="org-left"><code>Secondary Aspect</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Secondary aspects are those aspects that are not primary aspects.</code></td>
<td class="org-left"><code>imf:Aspect</code></td>
</tr>

<tr>
<td class="org-left"><code>imf:SystemBlock</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>imf:Terminal</code></td>
<td class="org-left"><code>Terminal</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>A terminal represents a point/port/boundry of connection/communication for exactly one system block or a stream. System blocks and streams may only be connected to other system blocks and streams via their terminals.</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>imf:Transport</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
