imf-ontology-source.org
** Properties

#+NAME: sparql_property
#+BEGIN_SRC ttl
SELECT ?type ?property ?prefLabel ?altLabels ?definition ?domain ?range ?characteristics ?superproperties
{
  ?property a ?type.
  FILTER (?type = owl:ObjectProperty || ?type = owl:DatatypeProperty || ?type = owl:AnnotationProperty )
  FILTER (!isBlank(?property))

  OPTIONAL { ?property skos:prefLabel ?prefLabel }
  OPTIONAL { ?property skos:definition ?definition }
  OPTIONAL { ?property rdfs:domain ?domain }
  OPTIONAL { ?property rdfs:range ?range }

  { SELECT ?property 
      (GROUP_CONCAT(?superproperty; SEPARATOR=", ") AS ?superproperties) 
      (GROUP_CONCAT(?characteristic; SEPARATOR=", ") AS ?characteristics) 
      (GROUP_CONCAT(?altLabel; SEPARATOR=", ") AS ?altLabels) 
    {
      OPTIONAL { ?property rdfs:subPropertyOf ?superproperty }
      OPTIONAL { ?property a ?characteristic .
          FILTER (?characteristic != owl:ObjectProperty && ?characteristic != owl:DatatypeProperty && ?characteristic != owl:AnnotationProperty )
      }
      OPTIONAL { ?property skos:altLabel ?altLabel }
    } GROUP BY ?property
  }
  
}
ORDER BY ?type ?property
#+END_SRC

#+CALL: py_run_sparql(query=sparql_property)

#+RESULTS:
| ~type~               | ~property~                 | ~prefLabel~    | ~altLabels~ | ~definition~                                                                                                         | ~domain~           | ~range~                | ~characteristics~                                                        | ~superproperties~                                                  |
|----------------------+----------------------------+----------------+-------------+----------------------------------------------------------------------------------------------------------------------+--------------------+------------------------+--------------------------------------------------------------------------+--------------------------------------------------------------------|
| ~owl:ObjectProperty~ | ~imf:associativeRelation~  |                |             | ~A generic associative relation.~                                                                                    | ~imf:AspectObject~ | ~imf:AspectObject~     |                                                                          | ~skos:related~                                                     |
| ~owl:ObjectProperty~ | ~imf:hasAspect~            | ~has aspect~   |             | ~Relates an aspect object with its aspect.~                                                                          | ~imf:AspectObject~ | ~imf:Aspect~           |                                                                          |                                                                    |
| ~owl:ObjectProperty~ | ~imf:hasChild~             |                |             |                                                                                                                      | ~imf:AspectObject~ | ~imf:AspectObject~     |                                                                          | ~skos:narrower, imf:hierarchicalRelation, imf:intraAspectRelation~ |
| ~owl:ObjectProperty~ | ~imf:hasLocation~          |                |             |                                                                                                                      | ~ub1bL46C17~       | ~ub1bL48C16~           |                                                                          | ~imf:interAspectRelation~                                          |
| ~owl:ObjectProperty~ | ~imf:hasParent~            |                |             |                                                                                                                      |                    |                        | ~owl:FunctionalProperty, owl:FunctionalProperty, owl:FunctionalProperty~ | ~imf:intraAspectRelation, imf:hierarchicalRelation, skos:broader~  |
| ~owl:ObjectProperty~ | ~imf:hierarchicalRelation~ |                |             | ~A generic hierachical relation that may be used to represent a breakdown structure.~                                | ~imf:AspectObject~ | ~imf:AspectObject~     | ~owl:IrreflexiveProperty~                                                | ~skos:semanticRelation~                                            |
| ~owl:ObjectProperty~ | ~imf:interAspectRelation~  |                |             |                                                                                                                      | ~imf:AspectObject~ | ~imf:AspectObject~     |                                                                          | ~skos:related~                                                     |
| ~owl:ObjectProperty~ | ~imf:intraAspectRelation~  |                |             | ~A generic relation between aspect objects of the same aspect~                                                       | ~imf:AspectObject~ | ~imf:AspectObject~     |                                                                          | ~skos:semanticRelation~                                            |
| ~owl:ObjectProperty~ | ~imf:isAspectOf~           | ~is aspect of~ |             | ~Relates an aspect object with the integrated object the aspect object provides a specification for/description of.~ | ~imf:AspectObject~ | ~imf:IntegratedObject~ |                                                                          |                                                                    |
| ~owl:ObjectProperty~ | ~imf:isConnectedTo~        |                |             |                                                                                                                      |                    |                        |                                                                          |                                                                    |
| ~owl:ObjectProperty~ | ~imf:isFulfilledBy~        |                |             |                                                                                                                      | ~ub1bL60C17~       | ~ub1bL62C16~           |                                                                          | ~imf:interAspectRelation~                                          |
| ~owl:ObjectProperty~ | ~imf:isInstalledAs~        |                |             |                                                                                                                      | ~ub1bL67C17~       | ~ub1bL69C16~           |                                                                          | ~imf:interAspectRelation~                                          |


