imf-ontology-source.html

<div id="outline-container-org09aaf89" class="outline-3">
<h3 id="org09aaf89"><span class="section-number-3">7.2</span> Properties</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-ttl" id="org6a84f25">SELECT ?type ?property ?prefLabel ?altLabels ?definition ?domain ?range ?characteristics ?superproperties
{
  ?property a ?type.
  FILTER (?type = owl:ObjectProperty || ?type = owl:DatatypeProperty || ?type = owl:AnnotationProperty )
  FILTER (!isBlank(?property))

  OPTIONAL { ?property skos:prefLabel ?prefLabel }
  OPTIONAL { ?property skos:definition ?definition }
  OPTIONAL { ?property rdfs:domain ?domain }
  OPTIONAL { ?property rdfs:range ?range }

  { SELECT ?property 
      (GROUP_CONCAT(?superproperty; SEPARATOR=", ") AS ?superproperties) 
      (GROUP_CONCAT(?characteristic; SEPARATOR=", ") AS ?characteristics) 
      (GROUP_CONCAT(?altLabel; SEPARATOR=", ") AS ?altLabels) 
    {
      OPTIONAL { ?property rdfs:subPropertyOf ?superproperty }
      OPTIONAL { ?property a ?characteristic .
          FILTER (?characteristic != owl:ObjectProperty &amp;&amp; ?characteristic != owl:DatatypeProperty &amp;&amp; ?characteristic != owl:AnnotationProperty )
      }
      OPTIONAL { ?property skos:altLabel ?altLabel }
    } GROUP BY ?property
  }

}
ORDER BY ?type ?property
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>type</code></th>
<th scope="col" class="org-left"><code>property</code></th>
<th scope="col" class="org-left"><code>prefLabel</code></th>
<th scope="col" class="org-left"><code>altLabels</code></th>
<th scope="col" class="org-left"><code>definition</code></th>
<th scope="col" class="org-left"><code>domain</code></th>
<th scope="col" class="org-left"><code>range</code></th>
<th scope="col" class="org-left"><code>characteristics</code></th>
<th scope="col" class="org-left"><code>superproperties</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:associativeRelation</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>A generic associative relation.</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>skos:related</code></td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:hasAspect</code></td>
<td class="org-left"><code>has aspect</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Relates an aspect object with its aspect.</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>imf:Aspect</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:hasChild</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>imf:hierarchicalRelation, imf:intraAspectRelation, skos:narrower</code></td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:hasLocation</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL46C17</code></td>
<td class="org-left"><code>ub1bL48C16</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>imf:interAspectRelation</code></td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:hasParent</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>owl:FunctionalProperty, owl:FunctionalProperty, owl:FunctionalProperty</code></td>
<td class="org-left"><code>imf:intraAspectRelation, imf:hierarchicalRelation, skos:broader</code></td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:hierarchicalRelation</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>A generic hierachical relation that may be used to represent a breakdown structure.</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>owl:IrreflexiveProperty</code></td>
<td class="org-left"><code>skos:semanticRelation</code></td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:interAspectRelation</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>skos:related</code></td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:intraAspectRelation</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>A generic relation between aspect objects of the same aspect</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>skos:semanticRelation</code></td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:isAspectOf</code></td>
<td class="org-left"><code>is aspect of</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Relates an aspect object with the integrated object the aspect object provides a specification for/description of.</code></td>
<td class="org-left"><code>imf:AspectObject</code></td>
<td class="org-left"><code>imf:IntegratedObject</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:isConnectedTo</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:isFulfilledBy</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL60C17</code></td>
<td class="org-left"><code>ub1bL62C16</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>imf:interAspectRelation</code></td>
</tr>

<tr>
<td class="org-left"><code>owl:ObjectProperty</code></td>
<td class="org-left"><code>imf:isInstalledAs</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>ub1bL67C17</code></td>
<td class="org-left"><code>ub1bL69C16</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>imf:interAspectRelation</code></td>
</tr>
</tbody>
</table>
</div>
</div>
